mkovatsc/wot-demo-devices/nrf51/examples/iot/coap/ipv6/client_server_observe/main.c
//Set the required functionality of the code here
#define FUNCTIONALITY										1  //1=SWITCH, 2=PIR, 3=PIR USING BUTTON 3
#define DEVICE_NAME                     "SWITCH_1"    // SWITCH_1   PIR_1 PIR_2                                    /**< Device name used in BLE undirected advertisement. */
#define EP_NAME													"ep=SWITCH1"; // SWITCH1    PIR1  PIR2

#include <stdbool.h>
#include <stdint.h>
#include "boards.h"
#include "nordic_common.h"
#include "nrf_delay.h"
#include "softdevice_handler.h"
#include "mem_manager.h"
#include "app_trace.h"
#include "app_timer_appsh.h"
#include "app_button.h"
#include "ble_advdata.h"
#include "ble_srv_common.h"
#include "ble_ipsp.h"
#include "iot_defines.h"
#include "iot_common.h"
#include "ipv6_api.h"
#include "icmp6_api.h"
#include "udp_api.h"
#include "iot_timer.h"
#include "coap_api.h"
#include "coap_observe_api.h"
#include "semantics.h"




/** Modify SERVER_IPV6_ADDRESS according to your setup.
 *  The address provided below is a place holder.  */
 //2001:470:cafe::38b2:cf42
#define SERVER_IPV6_ADDRESS 0x20, 0x01, 0x04, 0x70, 0xCA, 0xFE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x38, 0xB2, 0xCF, 0x50        /**< IPv6 address of the server node. */
																				
// The CoAP default port number 5683 MUST be supported by a server.
#define SERVER_PORT_NUM                 5683                                                  /**< CoAP default port number. */

#define LED_ONE                         BSP_LED_0_MASK
#define LED_TWO                         BSP_LED_1_MASK
#define LED_THREE                       BSP_LED_2_MASK
#define LED_FOUR                        BSP_LED_3_MASK

#define BUTTON_ONE                      BSP_BUTTON_0
#define BUTTON_TWO                      BSP_BUTTON_1
#define BUTTON_THREE                    BSP_BUTTON_2
#define BUTTON_FOUR                     BSP_BUTTON_3

#define COMMAND_OFF                     0x30
#define COMMAND_ON                      0x31
#define COMMAND_TOGGLE                  0x32

#define APP_TIMER_PRESCALER             31                                                    /**< Prescaler value for timer module to get a tick of about 1ms. */
#define APP_TIMER_MAX_TIMERS            2                                                     /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE         6                                                     /**< Size of timer operation queues. */

#define APP_ADV_TIMEOUT                 0                                                     /**< Time for which the device must be advertising in non-connectable mode (in seconds). 0 disables timeout. */
#define APP_ADV_ADV_INTERVAL            MSEC_TO_UNITS(333, UNIT_0_625_MS)                     /**< The advertising interval. This value can vary between 100ms to 10.24s). */
#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)              /**< Button debounce interval. */

#define LED_BLINK_INTERVAL_MS           300                                                   /**< LED blinking interval. */
#define COAP_TICK_INTERVAL_MS           1000                                                  /**< Interval between periodic callbacks to CoAP module. */

#define APP_RTR_SOLICITATION_DELAY      500                                                   /**< Time before host sends an initial solicitation in ms. */

#define DEAD_BEEF                       0xDEADBEEF                                            /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define MAX_LENGTH_FILENAME             128                                                   /**< Max length of filename to copy for the debug error handler. */

#define OBSERVE_NOTIFY_DELTA_MAX_AGE    2                                                     /**< Number of seconds prior to a max-age timeout which an updated state of the observed value should be sent to the observers. */


#define APP_DISABLE_LOGS                1                                                     /**< Disable debug trace in the application. */

#if (APP_DISABLE_LOGS == 0)

#define APPL_LOG  app_trace_log
#define APPL_DUMP app_trace_dump

#else // APP_DISABLE_LOGS

#define APPL_LOG(...)
#define APPL_DUMP(...)

#endif // APP_DISABLE_LOGS

#define APPL_ADDR(addr) APPL_LOG("%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x:%02x%02x\r\n", \
                                (addr).u8[0],(addr).u8[1],(addr).u8[2],(addr).u8[3],                            \
                                (addr).u8[4],(addr).u8[5],(addr).u8[6],(addr).u8[7],                            \
                                (addr).u8[8],(addr).u8[9],(addr).u8[10],(addr).u8[11],                          \
                                (addr).u8[12],(addr).u8[13],(addr).u8[14],(addr).u8[15])


#define PIR_HOLD_TIME 5

typedef enum
{
    LEDS_INACTIVE = 0,
    LEDS_BLE_ADVERTISING,
    LEDS_IPV6_IF_DOWN,
    LEDS_IPV6_IF_UP,
} display_state_t;

static ble_gap_addr_t         m_local_ble_addr;                                               /**< Local BLE address. */
static ble_gap_adv_params_t   m_adv_params;                                                   /**< Parameters to be passed to the stack when starting advertising. */
static const ipv6_addr_t      local_routers_multicast_addr = {{0xFF, 0x02, 0x00, 0x00, \
                                                               0x00, 0x00, 0x00, 0x00, \
                                                               0x00, 0x00, 0x00, 0x00, \
                                                               0x00, 0x00, 0x00, 0x02}};      /**< Multicast address of all routers on the local network segment. */

static app_timer_id_t         m_iot_timer_tick_src_id;                                        /**< App timer instance used to update the IoT timer wall clock. */
static uint8_t                m_well_known_core[100];
static display_state_t        m_display_state = LEDS_INACTIVE;                                /**< Board LED display state. */
//static const char             m_lights_name[] = "switch";
static const char             m_led3_name[]   = "status";

static const char             m_semantics_switch_name[] = "restdesc";
static const char             m_semantics_switch_status_name[]   = "statedesc";

static coap_resource_t        m_led3;
static coap_resource_t        m_semantic_sts;
static uint32_t               m_observer_sequence_num = 0;
static uint32_t               m_observer_sequence_num_statedesc = 0;
                                                               
static void app_coap_time_tick(iot_timer_time_in_ms_t);
static void notify_all_semantic_sts_subscribers(coap_msg_type_t type);
																															 
