mkovatsc/wot-demo-devices/nrf51/examples/iot/coap/ipv6/client_server_observe/main.c
    // Copy token.
    memcpy(&response_config.token[0], &p_request->token[0], p_request->header.token_len);
    // Copy token length.
    response_config.token_len = p_request->header.token_len;

    coap_message_t * p_response;
    uint32_t err_code = coap_message_new(&p_response, &response_config);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_remote_addr_set(p_response, &p_request->remote);
    APP_ERROR_CHECK(err_code);

    // Handle request.
    switch (p_request->header.code)
    {
        case COAP_CODE_GET:
        {
            p_response->header.code = COAP_CODE_205_CONTENT;
            
            // Select the first common content type between the resource and the CoAP client.
            coap_content_type_t ct_to_use;
            err_code = coap_message_ct_match_select(&ct_to_use, p_request, p_resource);
            if (err_code != NRF_SUCCESS)
            {
                // None of the accepted content formats are supported in this resource endpoint.
                p_response->header.code = COAP_CODE_415_UNSUPPORTED_CONTENT_FORMAT;
                p_response->header.type = COAP_TYPE_RST;
            }
            else
            {
							if (coap_message_opt_present(p_request, COAP_OPT_OBSERVE) == NRF_SUCCESS)
							{
									// Locate the option and check the value.
									uint32_t observe_option = 0;
									uint8_t index;
									for (index = 0; index < p_request->options_count; index++)
									{
											if (p_request->options[index].number == COAP_OPT_OBSERVE)
											{
													err_code = coap_opt_uint_decode(&observe_option,
																																	 p_request->options[index].length,
																																	 p_request->options[index].p_data);
													if (err_code != NRF_SUCCESS)
													{
														 APP_ERROR_CHECK(err_code);
													}
													break;
											}
									}

									if (observe_option == 0)
									{                        
											uint32_t handle;
											coap_observer_t observer;											
											observer.token_len              = p_request->header.token_len;
											observer.p_resource_of_interest = p_resource;
											memcpy(&observer.remote, &p_request->remote, sizeof(coap_remote_t));
											memcpy(observer.token, p_request->token, observer.token_len);
											observer.ct = ct_to_use;

											err_code = coap_observe_server_register(&handle, &observer);
											if (err_code == NRF_SUCCESS)
											{
													err_code = coap_message_opt_uint_add(p_response, COAP_OPT_OBSERVE, m_observer_sequence_num_statedesc++);
													APP_ERROR_CHECK(err_code);

													err_code = coap_message_opt_uint_add(p_response, COAP_OPT_MAX_AGE, p_resource->expire_time);
													APP_ERROR_CHECK(err_code);
											}
									}
									else
									{
											uint32_t handle;
											err_code = coap_observe_server_search(&handle, &p_request->remote, p_resource);
											if (err_code == NRF_SUCCESS)
											{
													err_code = coap_observe_server_unregister(handle);
													APP_ERROR_CHECK(err_code);
											}
									}
								}
							
							char *payload_str;
							//Depending on the selected resource (restdesc or swdesc) formulate the payload
							if(strcmp(p_resource->name, m_semantics_switch_name) == 0)
							{
								payload_str = SEMANTICS_SWITCH;
							}
							else
							{
								//payload for swdesc depends on the status of the switch..
								bool isOn = (bool)LED_IS_ON(LED_THREE);
								if(isOn)
									payload_str = SEMANTICS_SWITCH_STATUS_ON;
								else
									payload_str = SEMANTICS_SWITCH_STATUS_OFF;
							}
							
							char * response_str;
							
							// check Block2 option
						/* 0 1 2 3 4 5 6 7
							+-+-+-+-+-+-+-+-+
							|  NUM  |M| SZX |
							+-+-+-+-+-+-+-+-+*/
							
							uint32_t block2 = 0;
							uint32_t num = 0;
							int size = 64;
							uint32_t offset = 0;
							
							uint8_t count = p_request->options_count;
							for(int i=0; i < count; i++)
							{
								//APPL_LOG("[APPL]: Registration succeeded! : %s\r\n", p_response->options[i].p_data);
								if(p_request->options[i].number == 23) //Blockwise transfer
								{
										int j = 0;
										while(j < p_request->options[i].length) {
											block2 <<= 8;
											block2 |= p_request->options[i].p_data[j++];
										}
										num = block2>>4;
										size = coap_szx_to_size(block2 & 0x07);
										if (size > 64) size = 64;
										break; //there can be only one BLOCK option
								}
							}
							
							offset = num * size;
									
							char response_part[size];
							
							// check end of data -> more bit
							uint8_t more = 1;							
							int payload_len = strlen(payload_str);
							more = (offset + size) < payload_len;
							
							//APPL_LOG("Block2 offset=%d num=%d size=%d len=%d more%d", offset, num, size, payload_len, more);
							strncpy(response_part, payload_str + offset, size);
							//memcpy(response_part, SEMANTICS_SWITCH + offset, size);
							
							block2 = num<<4 | more<<3 | (coap_log_2(size / 16) & 0x07);
							
							err_code = coap_message_opt_uint_add(p_response, 23, block2);
							APP_ERROR_CHECK(err_code);
							response_str = response_part;
						
							err_code = coap_message_payload_set(p_response, response_str, strlen(response_str));
							APP_ERROR_CHECK(err_code);
            }
            break;
        }       
        default:
        {
            p_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
            break;
        }
    }

    uint32_t msg_handle;
    err_code = coap_message_send(&msg_handle, p_response);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_delete(p_response);
    APP_ERROR_CHECK(err_code);
}

static void led3_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_conf_t response_config;
    memset (&response_config, 0, sizeof(coap_message_conf_t));

