mkovatsc/wot-demo-devices/nrf51/examples/iot/coap/ipv6/client_server_observe/main.c
    err_code = coap_message_delete(p_response);
    APP_ERROR_CHECK(err_code);

    if (p_request->header.code == COAP_CODE_PUT)
    {
        notify_all_led3_subscribers(COAP_TYPE_NON);
				notify_all_semantic_sts_subscribers(COAP_TYPE_NON);
    }
}


static void coap_endpoints_init(void)
{
    uint32_t err_code;

    static coap_resource_t root;
    err_code = coap_resource_create(&root, "/");
    APP_ERROR_CHECK(err_code);

    static coap_resource_t well_known;
    err_code = coap_resource_create(&well_known, ".well-known");
    APP_ERROR_CHECK(err_code);
    err_code = coap_resource_child_add(&root, &well_known);
    APP_ERROR_CHECK(err_code);

    static coap_resource_t core;
    err_code = coap_resource_create(&core, "core");
    APP_ERROR_CHECK(err_code);

    core.permission = COAP_PERM_GET;
    core.callback   = well_known_core_callback;

    err_code = coap_resource_child_add(&well_known, &core);
    APP_ERROR_CHECK(err_code);

/*
    static coap_resource_t light_switch;
    err_code = coap_resource_create(&light_switch, m_lights_name);
    APP_ERROR_CHECK(err_code);

    err_code = coap_resource_child_add(&root, &light_switch);
    APP_ERROR_CHECK(err_code);
*/
    err_code = coap_resource_create(&m_led3, m_led3_name);
    APP_ERROR_CHECK(err_code);

    m_led3.permission      = (COAP_PERM_GET | COAP_PERM_PUT | COAP_PERM_OBSERVE);
    m_led3.callback        = led3_callback;
    m_led3.ct_support_mask = COAP_CT_MASK_APP_JSON | COAP_CT_MASK_PLAIN_TEXT;
    m_led3.max_age         = 15;

    err_code = coap_resource_child_add(&root, &m_led3);
    APP_ERROR_CHECK(err_code);
		
		
    static coap_resource_t semantics_switch;
    err_code = coap_resource_create(&semantics_switch, m_semantics_switch_name);
    APP_ERROR_CHECK(err_code);
		semantics_switch.permission      = (COAP_PERM_GET );
		semantics_switch.callback        = semantics_callback;
		semantics_switch.ct_support_mask = COAP_CT_MASK_PLAIN_TEXT;

    err_code = coap_resource_child_add(&root, &semantics_switch);
    APP_ERROR_CHECK(err_code);		
		
		//static coap_resource_t semantics_switch_status;
    err_code = coap_resource_create(&m_semantic_sts, m_semantics_switch_status_name);
    APP_ERROR_CHECK(err_code);
		m_semantic_sts.permission      = (COAP_PERM_GET | COAP_PERM_OBSERVE);
		m_semantic_sts.callback        = semantics_callback;
		m_semantic_sts.ct_support_mask = COAP_CT_MASK_PLAIN_TEXT;
		m_semantic_sts.max_age         = 15;

    err_code = coap_resource_child_add(&root, &m_semantic_sts);
    APP_ERROR_CHECK(err_code);

    uint16_t size = sizeof(m_well_known_core);
    err_code = coap_resource_well_known_generate(m_well_known_core, &size);
    APP_ERROR_CHECK(err_code);
}


static void coap_response_handler(uint32_t status, void * arg, coap_message_t * p_response)
{

    if (status == NRF_SUCCESS)
    {
        APPL_LOG("[APPL]: Response Code : %d\r\n", p_response->header.code);

        if (p_response->header.code == COAP_CODE_204_CHANGED)
        {
            //m_blink_led_three = true;
        }
				else if (p_response->header.code == COAP_CODE_201_CREATED)
        {
						uint8_t count = p_response->options_count;
						for(int i=0; i < count; i++)
						{
							APPL_LOG("[APPL]: Registration succeeded! : %s\r\n", p_response->options[i].p_data);
							/*if(p_response->options[i].number == 8) //Option where the location is known.
							{
								//m_registration_location = p_response->options[1];
								//char buf[] 
							}*/
						}
					
						
        }
        else
        {
            //m_blink_led_four = true;
        }
    }
}

enum RD_MESSAGE_KIND{REGISTER, DELETE};

/**@brief Function for interaction with Registration Server.
 *
 * @param[in]   pin_no         The pin number of the button pressed.
 * @param[in]   button_action  The action performed on button.
 */
static void send_rd_message(enum RD_MESSAGE_KIND messageKind)
{
    if(mp_interface == NULL)
    {
        return;
    }

    uint32_t err_code;
    //if (button_action == APP_BUTTON_PUSH)
    {
        coap_message_t      * p_request;
        coap_message_conf_t   message_conf;
        coap_remote_t         remote_device;
        message_conf.type = COAP_TYPE_CON;
			
				if(messageKind == REGISTER)
					message_conf.code = COAP_CODE_POST;
				else if(messageKind == DELETE)
					message_conf.code = COAP_CODE_DELETE;
				
				const char uri_part_rd[]  = "rd";
				const char uri_query_ep[]  = EP_NAME;
				//const char uri_query_lt[]  = "lt=30";

        message_conf.id = 0; // Auto-generate message ID.

        (void)uint16_encode(HTONS(m_global_token_count), message_conf.token);
        m_global_token_count++;

        message_conf.token_len = 2;
        message_conf.response_callback = coap_response_handler;

        err_code = coap_message_new(&p_request, &message_conf);

        APP_ERROR_CHECK(err_code);
        memcpy(&remote_device.addr[0], (uint8_t []){SERVER_IPV6_ADDRESS}, IPV6_ADDR_SIZE);
        remote_device.port_number = SERVER_PORT_NUM;
        err_code = coap_message_remote_addr_set(p_request, &remote_device);
        APP_ERROR_CHECK(err_code);
        switch (messageKind)
        {
            case REGISTER:
            {
                err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_PATH, (uint8_t *)uri_part_rd, strlen(uri_part_rd));
                APP_ERROR_CHECK(err_code);
							
							  err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_QUERY, (uint8_t *)uri_query_ep, strlen(uri_query_ep));
                APP_ERROR_CHECK(err_code);
							
								//err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_QUERY, (uint8_t *)uri_query_lt, strlen(uri_query_lt));
                //APP_ERROR_CHECK(err_code);
								#if(FUNCTIONALITY == 1)
									uint8_t payload[] = "</status>;obs;rt=\"switch\",</statedesc>;obs;rt=\"semantics\",</restdesc>;rt=\"semantics\"";
								#else
									uint8_t payload[] = "</status>;obs;rt=\"pir\",</statedesc>;obs;rt=\"semantics\",</restdesc>;rt=\"semantics\"";
								#endif
                err_code = coap_message_payload_set(p_request, payload, sizeof(payload)-1);
                APP_ERROR_CHECK(err_code);

                uint32_t handle;
                err_code = coap_message_send(&handle, p_request);
                if (err_code != NRF_SUCCESS)
                {
                    APPL_LOG("[APPL]: CoAP Message skipped, error code = 0x%08lX.\r\n", err_code);
                }
                err_code = coap_message_delete(p_request);
                APP_ERROR_CHECK(err_code);

                break;
            }
            case DELETE:
            {
                err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_PATH, (uint8_t *)uri_part_rd, strlen(uri_part_rd));
                APP_ERROR_CHECK(err_code);

                err_code = coap_message_opt_str_add(p_request, COAP_OPT_URI_PATH, (uint8_t *)uri_query_ep + 3 , strlen(uri_query_ep + 3));
                APP_ERROR_CHECK(err_code);

                uint32_t handle;
                err_code = coap_message_send(&handle, p_request);
                if (err_code != NRF_SUCCESS)
                {
                    APPL_LOG("[APPL]: CoAP Message skipped, error code = 0x%08lX.\r\n", err_code);
                }
                err_code = coap_message_delete(p_request);
                APP_ERROR_CHECK(err_code);

                break;
            }
            default:
                break;
        }
    }
}



/**@brief Function for handling button events.
 *
 * @param[in]   pin_no         The pin number of the button pressed.
 * @param[in]   button_action  The action performed on button.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{    
		
